#############################################################
#     Packages and Applications for a macOS base setup      #
#                                                           #
# Owner: Hajnalka Marki                                     #
#############################################################

cask_args appdir: '/Applications'           # Path to install

# Taps
# Upgrade outdated apps (Homebrew Cask, info: brew cu)
tap 'bou/cask-upgrade'

#############################################################
#                    CLI ESSENTIALS                         #
#               macOS base CLI essentials                   #
#############################################################

brew 'git'          # Git for version control
brew 'jq'           # JSON parser for JSON outputs and queries
brew 'tree'         # List directories in a tree structure

# deps
brew 'gettext'      # GNU internationalization (i18n) and localization (l10n) library
brew 'libunistring' # C string library for manipulating Unicode strings
brew 'oniguruma'    # Regular expressions library
brew 'pcre2'        # Perl compatible regular expressions library with a new API 

#############################################################
#                      DEV PACKAGES                         #
#         macOS apps and packages for development           #
#############################################################

brew 'gh'          # GitHub CLI
brew 'python'      # Python interpreter
brew 'docker'      # Container management

###########################Apps##############################

# API testing
cask 'postman'
# Visual Studio Code - code editor
cask 'visual-studio-code'
# DBeaver Community Edition
cask 'dbeaver-community'
# Dev Tools
cask 'iterm2'

#############################################################
#                      MODS PACKAGES                        #
#               macOS Mods - apps and packages              #
#############################################################

###########################Apps##############################
cask 'alt-tab'     # Alt-tab window switcher
cask 'maccy'       # Clipboard manager


